cases/subsonic/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     rhoCentralFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         0.004;

deltaT          1e-8;

adjustTimeStep  yes;
maxCo           0.5;
maxDeltaT       3e-7;

writeControl    adjustableRunTime;
writeInterval   5e-4;

purgeWrite      6;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;
